9/data/attachments/2978cae0856d7e19.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_820e7bf3-842a-4ec0-b85a-397ac4407f7d</nif:username>
            <nif:friendToBeAdded>Mark_painting_Friend_16438_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>